# Parameters
nc: 80
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# Darknet53 backbobe
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [32, 3, 1]],      # 0
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 1, Bottleneck, [64]],
    [-1, 1, Conv, [128, 3, 2]],
    [-1, 2, Bottleneck, [128]],
    [-1, 1, Conv, [256, 3, 2]],
    [-1, 8, Bottleneck, [256]],
    [-1, 1, Conv, [512, 3, 2]],
    [-1, 8, Bottleneck, [512]],
    [-1, 1, Conv, [1024, 3, 2]],
    [-1, 4, Bottleneck, [1024]],    # 10
  ]

# Yolo v3 head
head:
[
  [-1, 1, Bottleneck, [1024, False]],
  [-1, 1, Conv, [512, 1, 1]],
  [-1, 1, Conv, [1024, 3, 1]],
  [-1, 1, Conv, [512, 1, 1]],
  [-1, 1, Conv, [1024, 3, 1]],       # 15

  [-2, 1, Conv, [256, 1, 1]],
  [-1, 1, nn.UpSample, [None, 2, 'nearest']],
  [[-1, 8], 1, Concat, [1]],
  [-1, 1, Bottleneck, [512, False]],
  [-1, 1, Bottleneck, [512, False]],
  [-1, 1, Conv, [256, 1, 1]],
  [-1, 1, Conv, [512, 3, 1]],

  [-2, 1, Conv, [128, 1, 1]],
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [[-1, 6], 1, Concat, [1]],
  [-1, 1, Bottleneck, [256, False]],
  [-1, 2, Bottleneck, [256, False]],

  [[27, 22, 15], 1, Detect, [nc, anchors]],
]
